src/boundaryConditions/dynContactAngleModel/robinBC/growingDroplet2D/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       uniformDimensionedVectorField;
    location    "constant";
    object      g;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -2 0 0 0 0];
//value           (0 0 0);
//value		(0 0 -0.00532);
//value           ( 4.15 0 -8.89);//25
value	         (5.626 0 -8.036 ); //35
//value (0.422 0 -0.9063);
//gsin 0 -gcos

// ************************************************************************* //
