src/boundaryConditions/dynContactAngleModel/robinBC/growingDroplet2D/0.org/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    left
    {
        type    zeroGradient;
    }

    right
    {
        type    zeroGradient;
    }

    front
    {
        type    empty;
    }

    back
    {
        type    empty;
    }

    top
    {
        type    zeroGradient;
    }

    inlet
    {
        type                flowRateInletVelocity;
        // Express flow rate as fraction of droplet volume.
        // Use expression from https://en.wikipedia.org/wiki/Spherical_cap 
        // The cell depth for pseudo 2D is 1.0e-5 meters
        d           1.0e-5;
        pi          3.141592653589793;
        r           0.001;  // drop radius in meter
        theta0      60;     // Equilibrium contact angle in degree
        phi         #eval{(180 - 2*(90 - $theta0))*$pi/180};
        fraction    1;
        volumetricFlowRate  #eval{$fraction*$d*25*$r*$r*($phi - sin($phi))};
        extrapolateProfile  no;
        value               uniform (0 0 0);
    }

    bottomRemainder
    {
        type            noSlip;
    }
}

// ************************************************************************* //


